#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "Non-Clinical"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FLORIZEL-TRAINING.keycloak_role.observer_role will be created
  + resource "keycloak_role" "observer_role" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "Observer"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FLORIZEL-TRAINING.keycloak_role.patient_role will be created
  + resource "keycloak_role" "patient_role" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "Patient"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FLORIZEL-TRAINING.keycloak_saml_client.CLIENT will be created
  + resource "keycloak_saml_client" "CLIENT" {
      + assertion_consumer_post_url     = "https://hlbc-training.fonemedhms.com/adminusers/auth/saml/callback"
      + assertion_consumer_redirect_url = "https://hlbc-training.fonemedhms.com/adminusers/auth/saml/callback"
      + base_url                        = "https://hlbc-training.fonemedhms.com"
      + canonicalization_method         = "EXCLUSIVE"
      + client_id                       = "FLORIZEL-TRAINING"
      + client_signature_required       = false
      + description                     = "A health management platform providing medical triage services - training environment"
      + enabled                         = true
      + encrypt_assertions              = false
      + encryption_certificate          = (known after apply)
      + encryption_certificate_sha1     = (known after apply)
      + force_name_id_format            = true
      + force_post_binding              = true
      + front_channel_logout            = true
      + full_scope_allowed              = false
      + id                              = (known after apply)
      + include_authn_statement         = true
      + name                            = "FLORIZEL TRAINING"
      + name_id_format                  = "persistent"
      + realm_id                        = "moh_applications"
      + sign_assertions                 = false
      + sign_documents                  = true
      + signature_algorithm             = "RSA_SHA256"
      + signature_key_name              = "NONE"
      + signing_certificate             = (known after apply)
      + signing_certificate_sha1        = (known after apply)
      + signing_private_key             = (known after apply)
      + signing_private_key_sha1        = (known after apply)
      + valid_redirect_uris             = [
          + "https://hlbc-training.fonemedhms.com/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FLORIZEL-TRAINING.keycloak_saml_user_property_protocol_mapper.saml_user_email_mapper will be created
  + resource "keycloak_saml_user_property_protocol_mapper" "saml_user_email_mapper" {
      + client_id                  = (known after apply)
      + friendly_name              = "email"
      + id                         = (known after apply)
      + name                       = "email"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "email"
      + saml_attribute_name_format = "Basic"
      + user_property              = "email"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FLORIZEL-TRAINING.keycloak_saml_user_property_protocol_mapper.saml_user_first_name_mapper will be created
  + resource "keycloak_saml_user_property_protocol_mapper" "saml_user_first_name_mapper" {
      + client_id                  = (known after apply)
      + friendly_name              = "firstName"
      + id                         = (known after apply)
      + name                       = "firstName"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "firstName"
      + saml_attribute_name_format = "Basic"
      + user_property              = "firstName"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FLORIZEL-TRAINING.keycloak_saml_user_property_protocol_mapper.saml_user_last_name_mapper will be created
  + resource "keycloak_saml_user_property_protocol_mapper" "saml_user_last_name_mapper" {
      + client_id                  = (known after apply)
      + friendly_name              = "lastName"
      + id                         = (known after apply)
      + name                       = "lastName"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "lastName"
      + saml_attribute_name_format = "Basic"
      + user_property              = "lastName"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*